app/views/routines/show.html.erb

SELECT SUM("workouts"."duration_min") FROM "workouts" INNER JOIN "routine_items" ON "workouts"."id" = "routine_items"."workout_id" WHERE "routine_items"."routine_id" = 1
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" IN (11, 8, 13, 14)
---
            <div class="small text-muted">
              <%= [ item.workout.category, item.workout.level, ("#{item.workout.duration_min} min" if item.workout.duration_min) ].compact.join(" · ") %>