app/controllers/checkins_controller.rb

  def index
    @checkins = current_user.checkins.recent
    trend = current_user.checkins.chronological.where(checkin_date: 30.days.ago..).to_a
    @weight_series   = chart_series(trend.select { |c| c.weight.present? }) { |c| c.weight.to_f }
---
SELECT "checkins".* FROM "checkins" WHERE "checkins"."user_id" = 1 AND "checkins"."checkin_date" >= '2026-05-06' ORDER BY "checkins"."checkin_date" ASC, "checkins"."id" ASC
SELECT 1 AS one FROM "checkins" WHERE "checkins"."user_id" = 1 LIMIT 1

  def create
    @checkin = current_user.checkins.new(checkin_params)
    if @checkin.save
---
INSERT INTO "checkins" ("checkin_date", "created_at", "diastolic", "energy", "mood", "notes", "resting_hr", "sleep_hours", "stress", "systolic", "updated_at", "user_id", "water_oz", "weight") VALUES ('2026-06-08', '2026-06-08 18:34:24.266680', NULL, 4, 4, '', 70, NULL, 4, NULL, '2026-06-08 18:34:24.266680', 1, NULL, 170.0) RETURNING "id"

  def set_checkin
    @checkin = current_user.checkins.find(params[:id])
---
SELECT "checkins".* FROM "checkins" WHERE "checkins"."user_id" = 1 AND "checkins"."id" = 26 LIMIT 1