app/controllers/dashboard_controller.rb

SELECT "checkins".* FROM "checkins" WHERE "checkins"."user_id" = 1 AND "checkins"."checkin_date" >= '2026-05-06' ORDER BY "checkins"."checkin_date" ASC, "checkins"."id" ASC
SELECT "health_profiles".* FROM "health_profiles" WHERE "health_profiles"."user_id" = 1 LIMIT 1
SELECT "checkins"."weight" FROM "checkins" WHERE "checkins"."user_id" = 1 AND "checkins"."weight" IS NOT NULL ORDER BY "checkins"."checkin_date" DESC LIMIT 1
SELECT 1 AS one FROM "checkins" WHERE "checkins"."user_id" = 1 LIMIT 1
---
  def index
    @profile = current_user.ensure_health_profile
    @today   = Date.current

    # --- Wellness -------------------------------------------------------------
    @latest_checkin   = current_user.latest_checkin
    @recent_checkins  = current_user.checkins.recent.limit(7)
    @checkin_streak   = checkin_streak
    trend_checkins    = current_user.checkins.chronological.where(checkin_date: 30.days.ago..).to_a

    # --- Diet -----------------------------------------------------------------
    @today_meals      = current_user.meal_entries.for_date(@today).to_a
    @nutrition        = summarize(@today_meals)
    @calorie_target   = @profile.target_calories

    # --- Fitness --------------------------------------------------------------
    @recent_workouts  = current_user.workout_logs.recent.limit(5)
    @week_minutes     = current_user.workout_logs.this_week.sum(:duration_min)
    @week_sessions    = current_user.workout_logs.this_week.count
    @week_burn        = current_user.workout_logs.this_week.sum(:calories_burned)

    # --- Care plan / education ------------------------------------------------
    @recommended_workouts = recommended_workouts
    @recommended_articles = Article.newest.limit(3)

    # --- Trend series for the chart cards ------------------------------------
    @weight_series   = series(trend_checkins.select { |c| c.weight.present? }) { |c| c.weight.to_f }

SELECT SUM("meal_entries"."calories") AS "sum_calories", "meal_entries"."consumed_on" AS "meal_entries_consumed_on" FROM "meal_entries" WHERE "meal_entries"."user_id" = 1 AND "meal_entries"."consumed_on" BETWEEN '2026-05-30' AND '2026-06-05' GROUP BY "meal_entries"."consumed_on"
---
  def nutrition_week_series
    days = (0..6).map { |n| @today - (6 - n) }
    totals = current_user.meal_entries
                         .where(consumed_on: days.first..days.last)
                         .group(:consumed_on).sum(:calories)

SELECT "checkins"."checkin_date" FROM "checkins" WHERE "checkins"."user_id" = 1 ORDER BY "checkins"."checkin_date" DESC LIMIT 60
---
  def checkin_streak
    dates = current_user.checkins.order(checkin_date: :desc).limit(60).pluck(:checkin_date).uniq

SELECT "workouts".* FROM "workouts" WHERE "workouts"."category" IN ('Strength', 'Cardio', 'HIIT', 'Yoga', 'Pilates', 'Mobility', 'Recovery') ORDER BY RANDOM() LIMIT 3
---
  def recommended_workouts
    goal = @profile.primary_goal
    preferred =
      case goal
      when "Build strength" then %w[Strength HIIT]
      when "Weight loss"    then %w[HIIT Cardio]
      when "Stress & balance" then %w[Yoga Mobility Recovery]
      when "Increase energy" then %w[Cardio Pilates]
      else Workout::CATEGORIES
      end
    Workout.where(category: preferred).order("RANDOM()").limit(3).presence ||
      Workout.order("RANDOM()").limit(3)