app/controllers/meal_entries_controller.rb

SELECT SUM("meal_entries"."calories") AS "sum_calories", "meal_entries"."consumed_on" AS "meal_entries_consumed_on" FROM "meal_entries" WHERE "meal_entries"."user_id" = 1 AND "meal_entries"."consumed_on" BETWEEN '2026-05-30' AND '2026-06-05' GROUP BY "meal_entries"."consumed_on"
SELECT "meal_entries".* FROM "meal_entries" WHERE "meal_entries"."user_id" = 1 AND "meal_entries"."consumed_on" = '2026-06-05'
---
  def index
    @date  = parse_date(params[:date]) || Date.current
    @meals = current_user.meal_entries.for_date(@date)
                         .sort_by { |m| MealEntry.meal_order.fetch(m.meal_type, 99) }
    @totals = totals(@meals)
    @target = current_user.ensure_health_profile.target_calories
    @recent_days = current_user.meal_entries
                               .where(consumed_on: (@date - 6)..@date)
                               .group(:consumed_on).sum(:calories)

INSERT INTO "meal_entries" ("calories", "carbs_g", "consumed_on", "created_at", "description", "fat_g", "meal_type", "name", "protein_g", "updated_at", "user_id") VALUES (NULL, NULL, '2026-06-08', '2026-06-08 18:35:30.515893', 'Organic sea moss gel with natural organic fruits. Felt light on the stomach today!', NULL, 'Breakfast', 'Sea moss smoothie bowl', 15, '2026-06-08 18:35:30.515893', 1) RETURNING "id"
---
  def create
    @meal_entry = current_user.meal_entries.new(meal_entry_params)
    if @meal_entry.save