app/controllers/routines_controller.rb

  def index
    @routines = Routine.order(:level, :title)
---
SELECT "routines".* FROM "routines" ORDER BY "routines"."level" ASC, "routines"."title" ASC

  def show
    @routine = Routine.find(params[:id])
    @items   = @routine.routine_items.includes(:workout)
---
SELECT "routines".* FROM "routines" WHERE "routines"."id" = 1 LIMIT 1
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" IN (11, 8, 13, 14)