app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE (lower(username) = 'demo') LIMIT 1
---
  def create
    identifier = params[:username].to_s.downcase.strip
    user = User.find_by("lower(username) = ?", identifier) ||
           User.find_by("lower(email) = ?", identifier)