app/controllers/workout_logs_controller.rb

INSERT INTO "workout_logs" ("activity", "calories_burned", "created_at", "duration_min", "intensity", "notes", "performed_on", "updated_at", "user_id", "workout_id") VALUES ('Morning HIIT', 550, '2026-06-08 18:36:11.578933', NULL, 'High', '', '2026-06-08', '2026-06-08 18:36:11.578933', 1, NULL) RETURNING "id"
---
  def create
    @workout_log = current_user.workout_logs.new(workout_log_params)
    if @workout_log.save

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = 11 LIMIT 1
SELECT "workout_logs".* FROM "workout_logs" WHERE "workout_logs"."user_id" = 1 AND "workout_logs"."id" = 5 LIMIT 1
---
  def set_workout_log
    @workout_log = current_user.workout_logs.find(params[:id])