app/controllers/workouts_controller.rb

SELECT "workouts".* FROM "workouts" WHERE "workouts"."category" = 'Strength' ORDER BY "workouts"."category" ASC, "workouts"."title" ASC
---
  def index
    @category  = params[:category].presence
    @workouts  = Workout.by_category(@category).order(:category, :title)

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = 8 LIMIT 1
SELECT "workouts".* FROM "workouts" WHERE "workouts"."category" = 'Cardio' AND "workouts"."id" != 8 LIMIT 3
---
  def show
    @workout = Workout.find(params[:id])
    @related = Workout.where(category: @workout.category).where.not(id: @workout.id).limit(3)